#!/bin/bash

#Напишете командна процедура која управува со резервни копии на именици користејќи компресирани архивирачки
#датотеки.
#Процедурата треба да креира резервни копии, да ги врати и да ги листа сите постоечки резервни копии.
#Процедурата треба да ги чува сите резервни копии во именик именуван како „.backups“ во домашниот именик на
#корисникот.
#Процедурата треба да ги поддржува следните опции:
#-b <directory> којашто креира резервна копија (.tar.gz) од дадениот именик
#-r <file> којашто ја враќа дадената резервна копија од дадената .tar.gz датотека
#-l којашто ги листа сите резервни копии на корисникот, и
#-h којашто прикажува насоки за користење на процедурата.
#При креирање на резервна копија, процедурата мора да провери дали дадениот именик постои. Ако именикот не
#постои, треба да прикаже порака за грешка.
#При враќање на резервна копија, процедурата мора да провери дека дадената резервна копија постои. Ако
#датотеката не постои, треба да прикаже порака за грешка.
#Процедурата треба автоматски да го креира именикот за резервни копии, ако не постои.
#Ако процедурата се изврши без аргументи, треба да прикаже насоки за користење.
#Името на резервната копија треба да го содржи името на именикот и тековниот датум во форматот YYYY-MM-DD.

BACKUP_DIR="$HOME"/.backups
USAGE="USAGE: `basename $0` [-b directory] [-r file] [-l]"

createBackup(){
        DIR="$1"

        if [ ! -d "$DIR" ]
        then
        echo "ERROR: The directory '$DIR' does not exist."
        exit 1
        fi

        NAME=$(basename "$DIR")
        FILE="$BACKUP_DIR/${NAME}_$(date +%F).tar.gz"

        tar -czf "$FILE" "$DIR"
        echo "The backup '$FILE' is created."
}

restoreBackup(){
        FILE="$1"

        if [ ! -f "$FILE" ]
        then
                echo "ERROR: The file '$FILE' does not exist."
                exit 1
        fi

        tar -xzf "$FILE"
        echo "The ebackup '$FILE' is restored."
}

listBackups(){
        ls -lh "$BACKUP_DIR"
}

main() {

        mkdir -p "$BACKUP_DIR"
        if [ $# -lt 1 ]
                then
                        echo "$USAGE"
                        exit 1
                fi

        case "$1" in
                -b)
                        [ -z "$2" ] && { echo "$USAGE"; exit 1; }
                        createBackup "$2";;
                -r)
                        [ -z "$2" ] && { echo "$USAGE"; exit 1; }
                        restoreBackup "$2";;
                -l)
                        listBackups;;
                -h)
                        echo "$USAGE"
                        exit 1;;
        esac
}

main "$@"
