#!/bin/bash

#Напишете командна процедура move.sh којашто за сите датотеки со наставка .out од именик
#зададен како прв аргумент ќе ги ископира во именик зададен како втор аргумент. Потоа,
#процедурата треба да пресмета вкупна големина на ископираните датотеки за кои
#корисникот има привилегии за извршување.
#Процедурата треба:
#- да прикаже насоки за користење, ако не се проследени два аргументи и
#- да го креира именикот зададен како втор аргумент, ако тој не постои.

if [ $# -ne 2 ]
then
        echo "USAGE: `basename $0` source destination"
        exit 1
fi

src="${1%/}"
dest="${2%/}"

[ ! -d "$2" ] && mkdir "$2"


files=`ls -l "$src" |

grep '^-' |

awk '{ print $10; }' |

grep '.out&' `


for file in $files
do
        cp "$src/$file" "$dest/$file"
done

size=`ls -l "$dest" |

grep '^-..x"' |

awk 'BEGIN { sum = 0; } { sum += $6; } END { print sum }'`

echo $size
