#!/bin/bash

#Напишете командна процедура toptime.sh којашто користејќи ја командата за приказ на табела
#на процеси (top) ќе го прикаже вкупното време на извршување од почетокот до сега на
#процесите отпочнати од даден корисник кои се наоѓаат во првата група (batch) на приказ на
#процесите. Процедурата го прима името на корисникот како аргумент од командна линија. Ако
#не е наведен аргумент, процедурата треба да прикаже упатство за користење.

if [ $# -ne 1 ]
then
        echo "USAGE: `basename $0` username"
        exit 1
fi

username="$1"


top -b -n 1 | awk -v user="$username" '
BEGIN {
    sec = 0;
}

NR > 7 {
    if ($2 == user) {
        split($11, t, ":")
        split(t[2], s, ".")

        if (length(t) == 3) {
            sec += t[1] * 3600 + t[2] * 60 + s[1]
        } else if (length(t) == 2) {
            sec += t[1] * 60 + s[1]
        }
    }
}

END {
    print sec
}
'
