#!/bin/bash

#Напишете командна процедура loginfo.sh којашто за корисник предаден како прв аргумент ќе
#запише колку вкупно минути бил најавен во излезна датотека out.txt.
#Процедурата треба:
#- да прикаже насоки за користење, ако не е проследен аргумент,
#- да ја пребрише излезната датотека, ако таа постои, и
#- на крај да ја прикаже содржината на излезната датотека.

if [ $# -ne 1 ]
then
        echo "USAGE: `basename $0` username"
        exit 1
fi

user="$1"
file="out.txt"

minutes=`last | grep "^$user" |
 awk '$NF ~ /[0-9][0-9]:[0-9][0-9]/ {print $NF; }' |
 sed 's/[()]//g' |
 awk -F: 'BEGIN { sum = 0; } { sum += 60 * $1 + $2; } END { print sum; }'`

echo $minutes > "$file"
cat "$file"
