#!/bin/bash

#Напишете командна процедура showfiles.sh којашто прима повеќе текстуални датотеки како
#аргументи и ја прикажува нивната содржина.
#Процедурата мора за секоја датотека:
#- да провери дали датотеката постои,
#- ако датотеката не постои, да прикаже грешка,
#- ако датотеката постои, да ја обработи, и
#- да го испечати името на секоја датотека пред нејзината содржина.

for file in "$@"
do
	if [ -f "$file" ]
	then 
		echo "The file '$file' contains:"
		cat "$file"
		echo
	else
		echo "ERROR: The file '$file' does not exist"
	fi
done

